app/controllers/hosts_controller.rb

SELECT "hosts".* FROM "hosts"
---
  def index
    @hosts = Host.all

INSERT INTO "hosts" ("hostname", "serial_number", "reference_orange", "location", "project_name", "brand", "model", "electricity_consumption", "certificate", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "params[:user_id]"], ["LIMIT", 1]]
---
  def create
  @user_id = params[:user_id]
  @state = params[:state] == IS_USED
  @host = Host.create! hostname: params[:hostname],
  serial_number: params[:serial_number],
  reference_orange: params[:reference_orange],
  location: params[:location],
  project_name: params[:project_name],
  brand: params[:brand],
  model: params[:model],
  electricity_consumption: params[:electricity_consumption],
  certificate: params[:certificate],
  user: User.find_by_user_id("#{@user_id}"),
  state: @state